#+TITLE: Notes on: Artificial Intelligent Programming by Charniak, E., Riesbeck, C. K., McDermott, D. V., & Meehan, J. R. (1987)
#+Time-stamp: <2021-06-10 18:22:27 boxx>

- source :: cite:charniak-1987-artif-intel-progr

** Lists

We can formally define the notion of a /list/ as follows:

  1. ~NIL~ is a list.
  2. If /expression/ is an expression and /list/ is a list, then the result of (CONS /expression/ /list/) is a list.

Since this is a recursive definition, it is natural to think of using recursion when doing operations on lists *(!)*. For example, the following snippet of code defines the function ~SQUARE-LIST~ which takes a list of numbers and returns a list of their squares.

#+name: fig-1-6
#+begin_src lisp
    (DEFUN SQUARE-LIST (L)
      (COND ((NULL L) NIL)
            (T (CONS (SQUARE (CAR L))
                     (SQUARE-LIST (CDR L))))))

    (DEFUN SQUARE (N) (* N N))
#+end_src

(NULL /expression/) is equivalent to (EQUAL /expression/ NIL).

In ~SQUARE-LIST~, the first element of the list ~L~ is squared and put on the front of the list obtained by applying ~SQUARE-LIST~ to the rest of ~L~. For example, (SQUARE-LIST '(2 3)) leads to the following chain of evaluation:

(SQUARE-LIST '(2 3))
=  (CONS (SQUARE 2) (SQUARE-LIST '(3)))
=  (CONS 4 (CONS (SQUARE 3) (SQUARE-LIST NIL)))
=  (CONS 4 (CONS 9 NIL))
\Rightarrow (4 9)

In the definition of ~SQUARE-LIST~, there is one COND-clause for each clause of the recursive definition of lists. If the list ~L~ is empty then the list of its squares is empty, too. Otherwise, the list of squares is obtained by CONSing the square of the first element onto the squares of the rest of the elements.

The function ~SQUARE-LIST~ takes a list and transforms it into a list of equal length. It is just as easy to write a function that selects some of the elements and ignores others, thereby returning a list that is longer or shorter than the input list.

For example, the following program defines ~SQRT-LIST~, which takes a list of positive and negative numbers and returns a list of the square roots of the non-negative elements of the list *(!)*.

#+name: fig-1-7
#+begin_src lisp
              (DEFUN SQRT-LIST (L)
                (COND ((NULL L) NIL)
                      ((< (CAR L) 0) (SQRT-LIST (CDR L)))
                      ((EQUAL (CAR L) 0)
                       (CONS 0 (SQRT-LIST (CDR L))))
                      (T (CONS (SQRT (CAR L))
                               (CONS (- (SQRT (CAR L)))
                                     (SQRT-LIST (CDR L))))))))
#+end_src

#+RESULTS: fig-1-7
: SQRT-LIST

This function has one test for the empty list, and three COND-clauses for the recursive part of the list definition. If the ~CAR~ of ~L~ is less than zero, we skip over it by just taking ~SQRT-LIST~ of the ~CDR~. If it's zero exactly, we ~CONS~ a zero onto the remaining square roots. If it's positive, we have to include both the positive and negative roots. Thus one input list element can lead to zero, one, or two output elements *(!)*.

For example,

#+begin_src lisp
(SQRT-LIST '(-9 0 4 -25))
#+end_src

#+RESULTS:
| 0 | 2.0 | -2.0 |

As an example of another list-building function, we shall define the function ~REVERSE~. (REVERSE /list/) returns a list of the elements of /list/ backwards. It already exists in Lisp but it is instructive to define it ourselves. Here is one way of defining the function.

#+name: fig-1-8
#+begin_src lisp
  (DEFUN REVERSE (L)
    (LET ((RESULT NIL))
      (LOOP (IF (NULL L) (RETURN RESULT))
            (SETQ RESULT (CONS (CAR L) RESULT))
            (SETQ L (CDR L)))))
#+end_src

Notice how in an iterative loop, the function ~CONS~ naturally builds a list backwards *(!)*.

Notice also that ~REVERSE~ binds values to symbols in three different ways.

  1. First, ~L~ is the formal variable of the function and is bound to whatever list ~REVERSE~ is applied to.
  2. Second, ~RESULT~ is the local variable of the ~LET~ and is bound to ~NIL~ initially.
  3. Third, during the loop both ~RESULT~ and ~L~ are explicitly assigned new values with the reserved word ~SETQ~.

Both ~L~ and ~RESULT~ are local to the function ~REVERSE~. That is, they are unaffected *(!)* by the values of ~L~ and ~RESULT~ in any other function or expression, nor do they affect such values. It is a matter of good programming practice to make sure that all variables used in a function are local *(!)*, if at all possible, in order to avoid unexpected interferences between functions.

